public/linux/raiden2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-19 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting Raiden 2 working on Retropie</title>
<meta name="author" content="Yu Huo" />
<meta name="generator" content="Org Mode" />
<link href="https://cdn.simplecss.org/simple.min.css" rel="stylesheet" type="text/css" />
</head>
<body>
<header id="top" class="status">
<body> <div id='preamble' class='status'>
        <nav>
                <a href='/'>Home</a>
                <a href='/public/sitemap.html'>Posts</a>
                <a href='/public/software.html'>Softwares</a>
        </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Getting Raiden 2 working on Retropie</h1>
</header><p>
I used to be a big fan of <a href="https://en.wikipedia.org/wiki/Raiden_(video_game)">Raiden</a> and was able to get Raiden II working on my Retropie during the pandemic.
Today, after several some weeks of hard work, I feel like playing this classic again, but I forgot which ROM and emulator I used before.
</p>

<p>
Tonight after some trial and error I find this <a href="https://www.retrostic.com/pt/roms/mame/raiden-ii-40996">ROM</a> (Raiden II, US, Set 1) and it runs on the <code>lr-fbneo</code> emulator on Retropie.
The only thing I need to do is to copy this ROM to this directory
</p>
<div class="org-src-container">
<pre class="src src-nil">~/Retropie/roms/fba
</pre>
</div>
<p>
and the game should work out of the box!
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'> © Yu Huo 2022-2023. Created 2023-01-20, Last updated 2024-02-17, built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.7)</div>
</footer>
</body>
</html>
